// Знайдіть найбільші числа в масивах

// Повертає масив, що складається з найбільшого числа з кожного під-масиву. Для простоти, даний масив буде містити рівно 4 під-масиви.

// Пам'ятайте, ви можете перебирати масив за допомогою простого циклу, і мати доступ до кожного елемента через синтаксис масиву arr[i].

function largestOfFour(arr) {
    let max = [];
    let arrayLength = arr.length;
    for ( let i=0; i<arrayLength; i++) {
      max.push(Math.max.apply(null, arr[i]));
    }
    return max;
  }
  let largest = largestOfFour([[4, 5, 1, 3], [13, 27, 18, 26], [32, 35, 37, 39], [1000, 1001, 857, 1]]);
    console.log("Массив и больших чисел: " + largest);